{
  "categories": [
    {
      "cid": "c{number}",
      "title": "Category Title",
      "description": "Optional category description",
      "questions": [
        {
          "qid": "c{number}_q{number}",
          "title": "Question text goes here?",
          "sections": {
            "how_to_answer": {
              "content": "Main content supporting markdown formatting.\n\nUse double newlines for paragraphs.\n\nSupported markdown includes:\n- **bold text**\n- *italic text*\n- Bullet points\n\nYou can include example openers like: \"Start with...\"\n\nAnd structure recommendations like using the **STAR method**.",
              "key_points": [
                "Optional array of key points",
                "Each point as a string",
                "For quick reference"
              ]
            },
            "example_answer": {
              "content": "Main example answer content with markdown support.\n\nCan include structured parts like:\n- Context\n- Situation\n- Action\n- Result\n\nMaintain original formatting and emphasis using **bold** or *italic* text.",
              "structure": {
                "context": "Optional breakdown of the example",
                "situation": "What was the challenge",
                "action": "What you did",
                "result": "The outcome",
                "lessons": [
                  "Optional array of key learnings",
                  "Each learning as a string"
                ]
              }
            }
          }
        }
      ]
    }
  ],
  "metadata": {
    "version": "1.0",
    "last_updated": "YYYY-MM-DD",
    "conventions": {
      "ids": {
        "categories": "Prefix 'c' followed by number (c1, c2, ...)",
        "questions": "Category ID + '_q' + number (c1_q1, c1_q2, ...)"
      },
      "markdown": {
        "emphasis": "Use **bold** or *italic*",
        "lists": "Use standard markdown bullet points",
        "paragraphs": "Separate with double newlines"
      }
    }
  }
} 



example:

{
    "categories": [
      {
        "cid": "c1",
        "title": "Achievement & Success",
        "questions": [
          {
            "qid": "c1_q1",
            "title": "Tell me about your proudest professional achievement. What was the impact, and how did you measure its success?",
            "sections": {
              "how_to_answer": {
                "content": "When answering this question about your proudest achievement at work, focus on showing your **skills** and the **impact** you made. Think about your career and choose an accomplishment that aligns well with the job you are applying for.\n\nA good way to begin your answer is with a statement like: \"One professional achievement I am particularly proud of is...\" This sets the stage for your story and immediately grabs the interviewer's attention.\n\nAs you describe your achievement, use the **STAR method** (*Situation, Task, Action, Result*) to structure your response. This will help you provide a clear and concise narrative that highlights your role and the impact of your work.\n\nTry to include **specific numbers** when you can. Numbers help show the real impact of what you did. If you don't have exact figures, use estimates or percentages to give a sense of scale.\n\nFor example, you might start with: \"One professional achievement I am particularly proud of is when I led a project to streamline our company's supply chain process. This initiative resulted in a 20% reduction in operational costs and improved delivery times by 30%.\"\n\nFinally, don't forget to reflect on what you **learned** from the experience and how it has shaped your approach to work. This shows self-awareness and a commitment to continuous improvement."
              },
              "example_answer": {
                "content": "One professional achievement I am particularly proud of is when I started a company-wide sustainability initiative at my previous job in the manufacturing sector.\n\nWhen I joined the company, I noticed that our waste management practices were outdated and inefficient, leading to high disposal costs and a negative environmental impact. I saw an opportunity to make a significant change that would benefit both the company and the environment.\n\nI proposed and led a **cross-functional team** to implement a comprehensive recycling and waste reduction program. This involved conducting a thorough waste audit, researching best practices in sustainable manufacturing, and developing partnerships with local recycling facilities.\n\nWe faced several challenges along the way, including resistance to change from some long-time employees and the initial costs of implementing new systems. However, by clearly communicating the long-term benefits and providing thorough training, we were able to get buy-in from all levels of the organization.\n\nThe **impact** of this initiative was substantial. Within the first year, we reduced our landfill waste by 60% and increased our recycling rate from 15% to 75%. This helped us cut costs by $500,000 annually in waste disposal fees. Additionally, we saw a 10% increase in employee satisfaction scores, with many citing the company's commitment to sustainability as a key factor.\n\nTo track how well it was working, we set up a **monitoring system** that monitored our waste output, recycling rates, and associated costs on a monthly basis. We also conducted quarterly employee surveys to gauge engagement and gather suggestions for further improvements.\n\nThis achievement not only had a positive impact on the company's bottom line and environmental footprint, but it also showed we were an industry leader in sustainable manufacturing practices. We received recognition from local environmental agencies and even won a regional award for corporate sustainability.\n\nThe experience taught me the importance of thinking holistically about business processes, the power of effective change management, and the value of measuring and communicating results. These are skills I am excited to bring to this new role and apply to drive similar impactful initiatives."
              }
            }
          },
          {
            "qid": "c1_q2",
            "title": "Share a significant professional accomplishment where you had to lead a cross-functional team. What challenges did you face, and how did you overcome them?",
            "sections": {
              "how_to_answer": {
                "content": "... content here ..."
              },
              "example_answer": {
                "content": "... content here ..."
              }
            }
          }
        ]
      },
      {
        "cid": "c2",
        "title": "Challenges & Problem-Solving",
        "questions": [
          {
            "qid": "c2_q1",
            "title": "Tell me about a time you failed to meet a project deadline or objective. What did you learn from this experience, and how did you apply those lessons later?",
            "sections": {
              "how_to_answer": {
                "content": "... content here ..."
              },
              "example_answer": {
                "content": "... content here ..."
              }
            }
          }
        ]
      }
    ]
  }